Repository: xxefi/BooksAPI
Catalog: Back/Books.Application/Resources/Validators/ValidationMessages.*.resx
Languages: az, ru

source: Username is required
az: İstifadəçi adı tələb olunur
ru: Имя пользователя обязательно

# UsernameMinLength
source: Username must be at least {0} characters long
az: İstifadəçi adı ən azı {0} simvol olmalıdır
ru: Имя пользователя должно содержать минимум {0} символа

# UsernameMaxLength
source: Username must not exceed {0} characters
az: İstifadəçi adı {0} simvoldan çox olmamalıdır
ru: Имя пользователя не должно превышать {0} символов

# FirstNameRequired
source: First name is required
az: Ad tələb olunur
ru: Имя обязательно

# FirstNameMinLength
source: First name must be at least {0} characters long
az: Ad ən azı {0} simvol olmalıdır
ru: Имя должно содержать минимум {0} символов

# FirstNameMaxLength
source: First name must not exceed {0} characters
az: Ad {0} simvoldan çox olmamalıdır
ru: Имя не должно превышать {0} символов

# LastNameRequired
source: Last name is required
az: Soyad tələb olunur
ru: Фамилия обязательна

# LastNameMinLength
source: Last name must be at least {0} characters long
az: Soyad ən azı {0} simvol olmalıdır
ru: Фамилия должна содержать минимум {0} символов

# LastNameMaxLength
source: Last name must not exceed {0} characters
az: Soyad {0} simvoldan çox olmamalıdır
ru: Фамилия не должна превышать {0} символов

# EmailRequired
source: Email is required
az: Email tələb olunur
ru: Электронная почта обязательна

# EmailInvalid
source: Invalid email format
az: Yanlış email formatı
ru: Неверный формат электронной почты

# PasswordRequired
source: Password is required
az: Şifrə tələb olunur
ru: Пароль обязателен

# PasswordMinLength
source: Password must be at least {0} characters long
az: Şifrə ən azı {0} simvol olmalıdır
ru: Пароль должен содержать минимум {0} символов

# PasswordMaxLength
source: Password must not exceed {0} characters
az: Şifrə {0} simvoldan çox olmamalıdır
ru: Пароль не должен превышать {0} символов

# RoleRequired
source: Role is required
az: Rol tələb olunur
ru: Роль обязательна

# UsernameInvalidFormat
source: Invalid username format
az: İstifadəçi adı düzgün formatda deyil
ru: Неверный формат имени пользователя

# FirstNameInvalidFormat
source: Invalid first name format
az: Adın formatı düzgün deyil
ru: Неверный формат имени

# LastNameInvalidFormat
source: Invalid last name format
az: Soyadın formatı düzgün deyil
ru: Неверный формат фамилии

# PasswordInvalidFormat
source: Password must contain at least one letter and one number
az: Şifrə ən azı bir hərf və bir rəqəm olmalıdır
ru: Пароль должен содержать хотя бы одну букву и одну цифру

# ReviewTextRequired
source: Review text is required
az: Rəy mətnini daxil etmək tələb olunur
ru: Текст отзыва обязателен

# ReviewTextMaxLength
source: Review text must be no longer than {0} characters
az: Rəy mətninin uzunluğu {0} simvoldan çox ola bilməz
ru: Длина текста отзыва не должна превышать {0} символов

# RatingRequired
source: Rating is required
az: Reytinqi daxil etmək tələb olunur
ru: Рейтинг обязателен

# RatingRange
source: Rating must be between 1 and 5
az: Reytinq 1 və 5 arasında olmalıdır
ru: Рейтинг должен быть от 1 до 5

# UserIdRequired
source: User ID is required
az: İstifadəçi ID-si tələb olunur
ru: Требуется ID пользователя

# ReviewTextInvalidCharacters
source: Review text can only contain letters, numbers, and basic symbols (.,!?-)
az: Rəy mətnində yalnız hərflər, rəqəmlər və əsas simvollar (.,!?-) istifadə oluna bilər
ru: В тексте отзыва могут быть только буквы, цифры и базовые символы (.,!?-)

# BookIdRequired
source: Book Identificator is required
az: Kitab Identifikatoru tələb olunur
ru: Идентификатор книги обязателен

# QuantityGreaterThanZero
source: Quantity must be greater than 0
az: Miqdarı 0-dan böyük olmalıdır
ru: Количество должно быть больше 0

# PriceGreaterThanZero
source: Price must be greater than 0
az: Qiymət 0-dan böyük olmalıdır
ru: Цена должна быть больше 0

# PriceRequired
source: Price is required
az: Qiymət tələb olunur
ru: Цена обязательна

# QuantityRequired
source: Quantity is required
az: Miqdar tələb olunur
ru: Количество обязательно

# OrderItemsRequired
source: Order items are required
az: Sifarişin maddələri tələb olunur
ru: Товары в заказе обязательны

# OrderItemInvalid
source: Each order item must have a quantity greater than 0 and price greater than 0
az: Hər bir sifariş maddəsi miqdarı 0-dan çox və qiyməti 0-dan çox olmalıdır
ru: Каждый товар должен иметь количество больше 0 и цену больше 0

# TotalPriceGreaterThanZero
source: Total price must be greater than 0
az: Cəmi qiymət 0-dan böyük olmalıdır
ru: Общая стоимость должна быть больше 0

# StatusIdRequired
source: Status ID is required
az: Sifarişin statusu tələb olunur
ru: Статус заказа обязателен

# AddressRequired
source: Address is required
az: Ünvan tələb olunur
ru: Адрес обязателен

# TitleRequired
source: Title is required
az: Başlıq tələb olunur
ru: Название обязательно

# AuthorRequired
source: Author is required
az: Yazıçı tələb olunur
ru: Автор обязателен

# YearRequired
source: Year is required
az: İl tələb olunur
ru: Год обязателен

# GenreRequired
source: Genre is required
az: Janr tələb olunur
ru: Жанр обязателен

# YearInvalid
source: Year must be a valid number
az: İl düzgün rəqəm olmalıdır
ru: Год должен быть действительным числом

# TitleMaxLength
source: Title cannot exceed {0} characters
az: Başlıq {0} simvoldan çox ola bilməz
ru: Название не может превышать {0} символов

# TitleInvalid
source: Title contains invalid characters
az: Başlıqda səhv simvollar var
ru: Название содержит недопустимые символы

# AuthorMaxLength
source: Author cannot exceed {0} characters
az: Yazıçı {0} simvoldan çox ola bilməz
ru: Автор не может превышать {0} символов

# AuthorInvalid
source: Author contains invalid characters
az: Yazıçıda səhv simvollar var
ru: Автор содержит недопустимые символы

# GenreMaxLength
source: Genre cannot exceed {0} characters
az: Janr {0} simvoldan çox ola bilməz
ru: Жанр не может превышать {0} символов

# GenreInvalid
source: Genre contains invalid characters
az: Janrda səhv simvollar var
ru: Жанр содержит недопустимые символы
