Repository: xxefi/BooksAPI
Catalog: Back/Books.Application/Resources/Errors/ErrorsMessages.*.resx
Languages: az, ru

source: Book not found
az: Kitab tapılmadı
ru: Книга не найдена

source: No books found
az: Kitablar yoxdur
ru: Нет книг

source: Order item not found
az: Sifariş məhsulu tapılmadı
ru: Товар для заказа не найден

# NoOrderItemsFound
source: Order items not found
az: Sifariş məhsulları yoxdur
ru: Нет товаров в заказе

source: Order not found
az: Sifariş tapılmadı
ru: Заказ не найден

# NoOrdersFound
source: Orders not found
az: Sifarişlər yoxdur
ru: Нет заказов

source: Review not found
az: Şərh tapılmadı
ru: Отзыв не найден

source: No reviews found
az: Şərhlər yoxdur
ru: Отзывов не найдено

source: Role not found
az: Rol tapılmadı
ru: Роль не найден

source: No roles found
az: Rollar yoxdur
ru: Ролей не найдено

source: Book already exists
az: Kitab artıq mövcuddur
ru: Книга уже существует

# PaginationError
source: Invalid pagination parameters
az: Yanlış səhifələmə parametrləri
ru: Неверные параметры пагинации

source: Role Already Exists
az: Rol artıq mövcuddur
ru: Роль уже существует

source: User already exists
az: İstifadəçi artıq mövcuddur
ru: Пользователь уже существует

source: Old password incorrect
az: Yanlış köhnə parol
ru: Неверный старый пароль

source: Invalid email or password
az: Yanlış e-poçt ünvanı və ya şifrə
ru: Неверный адрес электронной почты или пароль

source: Invalid Refresh Token
az: Etibarsız yeniləmə tokeni
ru: Недопустимый токен обновления

source: Refresh Token Expired
az: Yeniləmə tokeninin müddəti bitdi
ru: Срок действия токена обновления истек

source: Secret Key Not Found
ru: Секретный ключ Не найден

# InvalidTokenF
source: Invalid Token Format
ru: Неверный формат токена
